<template>
    <div class="app-page-container">
        <div class="page-title">
            <h2>API</h2>
            <hr>
        </div>
        <section class="app-table">
            <div class="api-container">
                <div  class="api-input">
                    <p>API: {{userInfo}}</p>
                </div>
            </div>
            <div class="row api-links">
               <router-link to="/apiexample" class=" btn btn-api col offset-s1 s2 lx2 offset-lx2">Примеры</router-link>
               <router-link to="/Wiki" class=" btn btn-api col offset-s2 s2 lx2 offset-lx2">API Запросы</router-link>
               <router-link to="/testg" class=" btn btn-api col offset-s2 s2 lx2 offset-lx2">Тест API</router-link>    
            </div>
            <div>
                <ul class="collapsible collapsible-questions" ref="collapsible">
                    <li>
                        <div class="collapsible-header">Для чего нужен сервис BOYKO-CRM ?</div>
                        <div class="collapsible-body">
                            <span>BOYKO-CRM — это система для компаний, организаций, которые ведут торговую деятельность в интернете,
                            предназначенная для автоматизации взаимодействий с клиентами.</span>
                            <span> Используется система для повышения уровня продаж, оптимизации маркетинга и улучшения обслуживания клиентов
                            путём сохранения информации о клиентах и истории взаимоотношений с ними, установления и улучшения бизнес-процессов, последующего анализа результатов.</span>
                            <br><br><span> BOYKO-CRM система предоставляет доступ своим пользователям к таким сервисам системы как: </span>
                            <ul class="browser-default">
                                <li>Хранение списка товаров, которые присутствуют в оборотах продаж</li>
                                <li>Хранение списка клиентов, с которыми было взаимодействия, начиная от заказа завершая оплатой, или отменой заказов</li>
                                <li>Хранение и взаимодействия с заказами. Введите их статуса от его начала до конца</li>
                                <li>Удобный и современный интерфейс, который помогает улучшать и оптимизировать взаимодействия с клиентами и продажами</li>
                                <li>Функциональная и удобная система сортировки и поиска по критериям</li>
                                <li>Современный интерфейс на главной странице, для получения статистики продаж по месяцам</li>
                            </ul>
                            <h4>Что дает внедрение BOYKO-CRM</h4><br>
                            <ul class="browser-default">
                                <li>
                                    <p class="li-main-text">Увеличение прибыли</p>
                                    <span>Продавец обладает полной информацией о клиенте и истории продаж. Увеличивается количество сделок и быстрота заключения сделки. Легко сфокусироваться на самых выгодных сделках.</span>
                                </li>
                                <li>
                                    <p class="li-main-text">Повышение точности прогнозирования продаж</p>
                                    <span>Статистическая информация позволяет оценить вероятность заключения сделки и прогнозировать скорость прохождения клиентов по воронке продаж, что позволяет эффективно управлять денежными потоками компании.</span>
                                </li>
                                <li>
                                    <p class="li-main-text">Увеличение вероятности заключения сделки</p>
                                    <span>Автоматизация цикла продаж и распространение лучшего опыта на всех сотрудников отдела продаж повышает процент успешных сделок. База знаний по стандартным вопросам клиентов и ответам на них, база знаний по слабым и сильным сторонам работы конкурентов позволяет эффективно работать с клиентом даже начинающему продавцу.</span>
                                </li>
                                <li>
                                    <p class="li-main-text">Снижение издержек</p>
                                    <span>Автоматизация процесса продаж позволяет автоматизировать рутинные операции, процессы контроля и управление сотрудниками продаж.</span>
                                </li>
                                <li>
                                    <p class="li-main-text">Повышение производительности сотрудников</p>
                                    <span>Управление возможностями, календарное планирование и средства работы с контактами позволяют эффективно использовать рабочее время.</span>
                                </li>
                            </ul>
                        </div>
                    </li>
                    <li>
                        <div class="collapsible-header">Как работать з сервесом ?</div>
                        <div class="collapsible-body">
                            <ul class="browser-default">
                                <li>Для начала подключите ваш сайт к системе BOYKO-CRM, с помощью API ключа (его можно найти на странице "API" в самом вверху)</li>
                                <li>Добавьте на ваш сайт функционал, отправки заказов, клиентов, товаров на BOYKO-CRM. С примерами отправки можно ознакомиться кликнув на кнопку вверху "Примеры" или перейти по <router-link to="/apiexample">ссылке</router-link></li>
                                <li>Для добавления клиента, необязательно создавать запрос. При запросе на добавление заказа, сервер найдет по номеру телефона клиента и обновит его историю, если клиента не будет найдено он его создаст</li>
                                <li>Перед настройкой вашего сайта, можете ознакомиться с функционалом API кликнув по кнопке вверху "Тест API" или перейти по <router-link to="/testg">ссылке</router-link>.<br>
                                    Все API запросы можно найти кликнув по кнопке вверху "API запросы" или перейти по <router-link to="/Wiki">ссылке</router-link>
                                </li>
                                <li>Для получения в дальнейшем информации по продажам на главной странице, необходимо перед запуском продаж, добавить все товары которые находятся в обороте</li>
                                <li>После того как все было подключено и настроено, можете начинать отслеживать приходящие заказы</li>
                                <li>График на главной странице будет обновляться 1 раз в день</li>
                            </ul>
                        </div>
                    </li>
                    <li>
                        <div class="collapsible-header">Почему я вижу надпись "На данный момент товаров еще нет" ?</div>
                        <div class="collapsible-body">
                            <span>Если вы видите надпись "На данный момент товаров еще нет", это означает что еще не было добавлено ни 1-о заказа, если вы уверены что вы добавляли, возможно вы неправильно настроили функционал на вашем сайте (проверьте ли совпадают api ключи, а так же проверьте ответы от сервера).</span>
                            <br><span>Если вы уверены, что все настроено правильно свяжитесь с нами, мы постараемся помочь вам</span>
                        </div>
                    </li>
                    <li>
                        <div class="collapsible-header">Почему я вижу надпись "На данный момент заказов еще нет" ?</div>
                        <div class="collapsible-body">
                            <span>Если вы видите надпись "На данный момент заказов еще нет", это означает что еще не было добавлено ни 1-о заказа, если вы уверены заказы были добавлены, возможно вы неправильно настроили функционал на вашем сайте (проверьте ли совпадают api ключи, а так же проверьте ответы от сервера).</span>
                            <br><span>Если вы уверены, что все настроено правильно свяжитесь с нами, мы постараемся помочь вам</span>
                        </div>
                    </li>
                    <li>
                        <div class="collapsible-header">Почему я вижу надпись "На данный момент клиентов еще нет" ?</div>
                        <div class="collapsible-body">
                            <span>Если вы видите надпись "На данный момент клиентов еще нет", это означает что еще не было добавлено ни 1-о клиента, если вы уверены клиенты были добавлены, возможно вы неправильно настроили функционал на вашем сайте (проверьте ли совпадают api ключи, а так же проверьте ответы от сервера).</span>
                            <br><span>Если вы уверены, что все настроено правильно свяжитесь с нами, мы постараемся помочь вам</span>
                        </div>
                    </li>
                    <li>
                        <div class="collapsible-header">Почему мой график пустой ?</div>
                        <div class="collapsible-body">
                            <span>Если ваш график пустой или на главной странице вы виидите надпись "На данный момент статистика не доступна", возможно вы не неправильно настроили функционал на вашем сайте (проверьте ли совпадают api ключи, а так же проверьте ответы от сервера).</span>
                            <br><span>Для коректной роботы графика, необходимо добавить товары, которые есть в обороте на вашем сайте (те товары на которые будут приходить заказы), после того как вы проделаете данную процедуру график должен зарабоать.</span>
                            <br><span>Если способы выше вам не помогли, свяжитесь с нами, мы постараемся помочь вам</span>
                        </div>
                    </li>
                </ul>
            </div>        
        </section>
    </div>
</template>
<script>
export default {
    name: 'Documentation',
    metaInfo:{
        title: 'API | BOYKO-CRM'
    },
    data:()=>({
        userInfo:[],
        collapsible:null
    }),
    async created(){
        if(!Object.keys(this.$store.getters.info).length){
            await this.$store.dispatch('fetchInfo')
        }
        this.userInfo = await this.$store.getters.info.api_key
    },
    mounted(){
        this.collapsible = M.Collapsible.init(this.$refs.collapsible);
    },
    methods:{
        
    }

}
</script>